<a href="https://colab.research.google.com/github/Debanjan-C/WANG-690-FALL-2020/blob/master/Assignment-06/Data_690_HW_6.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data 690 - Assignment 6
Debanjan Chowdhury

**Objective** - We are redoing our homework 4 with using Pandas. We initially import an html webpage and load each of the tables in the dataset. We set the first table into one dataframe and the other table will be in the other dataframe. Then we check both dataframes and see that the first dataframe contains the main data set. Then we will be cleansing the data set.

In [1]:
#import Pandas
import pandas as pd

**1. Use Pandas read_html() function to retrive the HTML tables as dataframes from the web page: https://www.genealogybranches.com/censuscosts.html**

In [2]:
#We read the html link and show each of the rows in the link
df_list = pd.read_html("https://www.genealogybranches.com/censuscosts.html")
df_list

[              0                 1               2                        3
 0   Census Year  Total Population     Census Cost  Average Cost Per Person
 1          1790           3929214         $44,377               1.13 cents
 2          1800           5308483         $66,109               1.24 cents
 3          1810           7239881        $178,445               2.46 cents
 4          1820           9633822        $208,526               2.16 cents
 5          1830          12866020        $378,545               2.94 cents
 6          1840          17069458        $833,371               4.88 cents
 7          1850          23191876      $1,423,351               6.14 cents
 8          1860          31443321      $1,969,377               6.26 cents
 9          1870          38558371      $3,421,198               8.87 cents
 10         1880          50155783      $5,790,678              11.54 cents
 11         1890          62979766     $11,547,127              18.33 cents
 12         1900          76303387     $11,854,000              15.54 cents
 13         1910          91972266     $15,968,000              17.07 cents
 14         1920         105710620     $25,117,000              23.76 cents
 15         1930         122775046     $40,156,000              32.71 cents
 16         1940         131669275     $67,527,000              51.29 cents
 17         1950         151325798     $91,462,000              60.44 cents
 18         1960         179323175    $127,934,000              71.34 cents
 19         1970         203302031    $247,653,000                    $1.22
 20         1980         226542199  $1,078,488,000                    $4.76
 21         1990         248718301  $2,492,830,000                   $10.02
 22         2000         281421906    $4.5 Billion                   $15.99
 23        2010*         308745538     $13 Billion                   $42.11,
                                                    0
 0  The U.S. population reached 300,000,000 on 17 ...]

**2. Find out how many HTML tables Pandas retrieves from the web page. Find out which dataframe contain the data and use it for further processing.**

In [3]:
#We notice two datasets in the html link and seperate them by df[0] and df[1]
df1 = df_list[0]
df1

              0                 1               2                        3
0   Census Year  Total Population     Census Cost  Average Cost Per Person
1          1790           3929214         $44,377               1.13 cents
2          1800           5308483         $66,109               1.24 cents
3          1810           7239881        $178,445               2.46 cents
4          1820           9633822        $208,526               2.16 cents
5          1830          12866020        $378,545               2.94 cents
6          1840          17069458        $833,371               4.88 cents
7          1850          23191876      $1,423,351               6.14 cents
8          1860          31443321      $1,969,377               6.26 cents
9          1870          38558371      $3,421,198               8.87 cents
10         1880          50155783      $5,790,678              11.54 cents
11         1890          62979766     $11,547,127              18.33 cents
12         1900          76303387     $11,854,000              15.54 cents
13         1910          91972266     $15,968,000              17.07 cents
14         1920         105710620     $25,117,000              23.76 cents
15         1930         122775046     $40,156,000              32.71 cents
16         1940         131669275     $67,527,000              51.29 cents
17         1950         151325798     $91,462,000              60.44 cents
18         1960         179323175    $127,934,000              71.34 cents
19         1970         203302031    $247,653,000                    $1.22
20         1980         226542199  $1,078,488,000                    $4.76
21         1990         248718301  $2,492,830,000                   $10.02
22         2000         281421906    $4.5 Billion                   $15.99
23        2010*         308745538     $13 Billion                   $42.11

In [4]:
#We set the second table in df2
df2 = df_list[1]
df2

                                                   0
0  The U.S. population reached 300,000,000 on 17 ...

**3. Display and explore the data (rows, columns, etc.) and determine the data quality (bad rows, bad columns, bad elements, null values, etc.)**

In [5]:
#We check for the rows and columns. We have 24 rows and 4 columns.
df1.shape

(24, 4)

In [6]:
#We check which value amongst all of these is null and none are. 
df1.isnull()

        0      1      2      3
0   False  False  False  False
1   False  False  False  False
2   False  False  False  False
3   False  False  False  False
4   False  False  False  False
5   False  False  False  False
6   False  False  False  False
7   False  False  False  False
8   False  False  False  False
9   False  False  False  False
10  False  False  False  False
11  False  False  False  False
12  False  False  False  False
13  False  False  False  False
14  False  False  False  False
15  False  False  False  False
16  False  False  False  False
17  False  False  False  False
18  False  False  False  False
19  False  False  False  False
20  False  False  False  False
21  False  False  False  False
22  False  False  False  False
23  False  False  False  False

In [7]:
"""
If we can see in this example and the one below, we only have column headers with
the column indexes(0,1, 2, 3) rather than the words that define each column(On second row). 
"""
df1.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [8]:
#Take a look at the header and the first row. 
df1.head()

             0                 1            2                        3
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

**4. Document the data quality issues using a Markdown cell so the reader understands what the problems are.**
- Our main issue is that we have the main header of the columns as 0, 1, 2, 3 and all. They do not represent anything. The headers show us what each column in the dataset represents and they are located in the first row instead of the header. So, we replace it in order to make: census year, total population and all the headers.

In [9]:
# the first row is bad quality as it writes (1, 2, 3) and those are not the titles of the rows
df1.columns

Int64Index([0, 1, 2, 3], dtype='int64')

In [10]:
# We check our heading of each column and indexes are the heading instead of the ('Census Year', 'Total Population', etc)
head_row = df1.iloc[0]
head_row

0                Census Year
1           Total Population
2                Census Cost
3    Average Cost Per Person
Name: 0, dtype: object

In [11]:
"""
We set our column header to the first row which would be the header data.
However, we still have that same data as the first row along with header
"""
df1.columns = head_row
df1.head()

0  Census Year  Total Population  Census Cost  Average Cost Per Person
0  Census Year  Total Population  Census Cost  Average Cost Per Person
1         1790           3929214      $44,377               1.13 cents
2         1800           5308483      $66,109               1.24 cents
3         1810           7239881     $178,445               2.46 cents
4         1820           9633822     $208,526               2.16 cents

In [12]:
#Due to the first row and header being same, we drop the first row in the table
df1.drop([0], inplace = True)
df1.head()

0 Census Year Total Population Census Cost Average Cost Per Person
1        1790          3929214     $44,377              1.13 cents
2        1800          5308483     $66,109              1.24 cents
3        1810          7239881    $178,445              2.46 cents
4        1820          9633822    $208,526              2.16 cents
5        1830         12866020    $378,545              2.94 cents

**5. Write a function named cleanse_year() that takes a string as input and removes any asterisks in the string and return the cleansed string. Test the function by using test strings (for example, "1989*", "20*10")**

- We are cleansing the cunsus year data

In [13]:
"""
We develop a function that will take the year data from the table and cleanse it,
so that it has the correct format. Therefore, in this case we look for a ('*')
and remove it from the data values. 
"""
def cleanse_year(str):
  str = str.replace('*', '')
  return str

In [14]:
#We test the function by checking it with the census year values in the dataframe.
for i in df1['Census Year']:
  print(cleanse_year(i))

1790
1800
1810
1820
1830
1840
1850
1860
1870
1880
1890
1900
1910
1920
1930
1940
1950
1960
1970
1980
1990
2000
2010

In [15]:
# We apply the cleanse year function and update the census year column in the data frame.
df1['Census Year'] = df1['Census Year'].apply(cleanse_year)
df1['Census Year']

1     1790
2     1800
3     1810
4     1820
5     1830
6     1840
7     1850
8     1860
9     1870
10    1880
11    1890
12    1900
13    1910
14    1920
15    1930
16    1940
17    1950
18    1960
19    1970
20    1980
21    1990
22    2000
23    2010
Name: Census Year, dtype: object

**7. Repeat this process for column "Total Population", "Census Cost", "Average Cost Per Person". (define, test, and apply the function)**

- We are cleansing the data for population

In [16]:
"""
We develop a function that will take the population data from the table and cleanse it,
so that it has the correct format. Therefore, in this case we look for commas
and remove it from the respective column in the dataframe. 
"""
def cleanse_pop(str):
  str = str.replace(',', '')
  return str

In [17]:
#We test the function by adding the values from population column in the dataframe.
for i in df1['Total Population']:
  print(cleanse_pop(i))

3929214
5308483
7239881
9633822
12866020
17069458
23191876
31443321
38558371
50155783
62979766
76303387
91972266
105710620
122775046
131669275
151325798
179323175
203302031
226542199
248718301
281421906
308745538

In [18]:
# We apply the cleanse population (pop) function and update the census population column in the data frame.
df1['Total Population'] = df1['Total Population'].apply(cleanse_pop)
df1['Total Population']

1       3929214
2       5308483
3       7239881
4       9633822
5      12866020
6      17069458
7      23191876
8      31443321
9      38558371
10     50155783
11     62979766
12     76303387
13     91972266
14    105710620
15    122775046
16    131669275
17    151325798
18    179323175
19    203302031
20    226542199
21    248718301
22    281421906
23    308745538
Name: Total Population, dtype: object

- We are cleansing the census cost field.

In [19]:
"""
We develop a function that will take the census cost data from the table and cleanse it,
so that it has the correct format. We take the dollar signs and commas and remove them
from the datasets in the column. We have a row that says the data is 4.5 billion. We
update that row and add 8 zeroes after 45 as 4.5 billion would mean that we would need to
add 8 0's as decimal place is also counted. We also checked for the row that has 13 billion,
but added 9 zeroes after it as we had no decimals and a billion has 9 zeroes.
"""
def cleanse_cost(cost_str):
  upd_cost = cost_str.replace('$', '')
  upd_cost = upd_cost.replace(',', '')
  
  if cost_str.find("4.5") == 1:
    upd_cost = "45" + "0" * 8
  elif cost_str.find('Billion') != -1:
    upd_cost = '13' + '0' * 9
  return upd_cost

In [20]:
#We test the function by adding the values from census cost column in the dataframe.
for i in df1['Census Cost']:
  print(cleanse_cost(i))

44377
66109
178445
208526
378545
833371
1423351
1969377
3421198
5790678
11547127
11854000
15968000
25117000
40156000
67527000
91462000
127934000
247653000
1078488000
2492830000
4500000000
13000000000

In [21]:
# We apply the cleanse cost function and update the census population column in the data frame.
df1['Census Cost'] = df1['Census Cost'].apply(cleanse_cost)
df1['Census Cost']

1           44377
2           66109
3          178445
4          208526
5          378545
6          833371
7         1423351
8         1969377
9         3421198
10        5790678
11       11547127
12       11854000
13       15968000
14       25117000
15       40156000
16       67527000
17       91462000
18      127934000
19      247653000
20     1078488000
21     2492830000
22     4500000000
23    13000000000
Name: Census Cost, dtype: object

In [22]:
"""
We develop a function that will take the average census cost data from the table and cleanse it,
so that it has the correct format. We take the dollar signs and remove it from the datasets in the column.
Following that, we check for the rows that have the words, 'cents in them and remove that word. After that, 
we must convert the cents into dollar formats as all other datas are in that format. Therefore, we converted the 
string datas to floating point and divided it by 100 as 1 dollar is 100 cents and to convert from cents to dollars
we need to divide it by 100. After that, we converted the other datas to string to maintain consistency with all rows.
"""
def cleanse_avg_cost(avg_cost):
  upd_avg_cost = avg_cost.replace('$', '')

  if (avg_cost.find('cents') != -1):
    upd_avg_cost = avg_cost.replace(" cents", "")
    upd_avg_cost = float(upd_avg_cost)
    upd_avg_cost = round((upd_avg_cost/ 100), 4)
    upd_avg_cost = str(upd_avg_cost)

  return upd_avg_cost

In [23]:
#We test the function by adding the values from average census cost per person column in the dataframe.
for i in df1['Average Cost Per Person']:
  print(cleanse_avg_cost(i))

0.0113
0.0124
0.0246
0.0216
0.0294
0.0488
0.0614
0.0626
0.0887
0.1154
0.1833
0.1554
0.1707
0.2376
0.3271
0.5129
0.6044
0.7134
1.22
4.76
10.02
15.99
42.11

In [24]:
# We apply the average cleanse cost per person function and update the average census cost population column in the data frame.
df1['Average Cost Per Person'] = df1['Average Cost Per Person'].apply(cleanse_avg_cost)
df1['Average Cost Per Person']

1     0.0113
2     0.0124
3     0.0246
4     0.0216
5     0.0294
6     0.0488
7     0.0614
8     0.0626
9     0.0887
10    0.1154
11    0.1833
12    0.1554
13    0.1707
14    0.2376
15    0.3271
16    0.5129
17    0.6044
18    0.7134
19      1.22
20      4.76
21     10.02
22     15.99
23     42.11
Name: Average Cost Per Person, dtype: object

In [25]:
#This is the output of our dataframe updated with cleansed data.
df1

0  Census Year Total Population  Census Cost Average Cost Per Person
1         1790          3929214        44377                  0.0113
2         1800          5308483        66109                  0.0124
3         1810          7239881       178445                  0.0246
4         1820          9633822       208526                  0.0216
5         1830         12866020       378545                  0.0294
6         1840         17069458       833371                  0.0488
7         1850         23191876      1423351                  0.0614
8         1860         31443321      1969377                  0.0626
9         1870         38558371      3421198                  0.0887
10        1880         50155783      5790678                  0.1154
11        1890         62979766     11547127                  0.1833
12        1900         76303387     11854000                  0.1554
13        1910         91972266     15968000                  0.1707
14        1920        105710620     25117000                  0.2376
15        1930        122775046     40156000                  0.3271
16        1940        131669275     67527000                  0.5129
17        1950        151325798     91462000                  0.6044
18        1960        179323175    127934000                  0.7134
19        1970        203302031    247653000                    1.22
20        1980        226542199   1078488000                    4.76
21        1990        248718301   2492830000                   10.02
22        2000        281421906   4500000000                   15.99
23        2010        308745538  13000000000                   42.11

**8. After all columns are cleansed, save the clenased dataframe to a file named "census_cost_cleansed.csv" using CSV format.**

In [26]:
# We save the updated dataframe in a csv file and name it as cleansed_data.csv
df1.to_csv('cleansed_data.csv')

**9.Use Pandas to read the saved cleansed file and explore to make sure it is clean**

In [27]:
# We read the csv file and output each row in the data. 
pd.read_csv('cleansed_data.csv', index_col=0)

    Census Year  Total Population  Census Cost  Average Cost Per Person
1          1790           3929214        44377                   0.0113
2          1800           5308483        66109                   0.0124
3          1810           7239881       178445                   0.0246
4          1820           9633822       208526                   0.0216
5          1830          12866020       378545                   0.0294
6          1840          17069458       833371                   0.0488
7          1850          23191876      1423351                   0.0614
8          1860          31443321      1969377                   0.0626
9          1870          38558371      3421198                   0.0887
10         1880          50155783      5790678                   0.1154
11         1890          62979766     11547127                   0.1833
12         1900          76303387     11854000                   0.1554
13         1910          91972266     15968000                   0.1707
14         1920         105710620     25117000                   0.2376
15         1930         122775046     40156000                   0.3271
16         1940         131669275     67527000                   0.5129
17         1950         151325798     91462000                   0.6044
18         1960         179323175    127934000                   0.7134
19         1970         203302031    247653000                   1.2200
20         1980         226542199   1078488000                   4.7600
21         1990         248718301   2492830000                  10.0200
22         2000         281421906   4500000000                  15.9900
23         2010         308745538  13000000000                  42.1100